Revit 2027 API
FabricRoundingManager.SegmentLengthRounding Property
 The rounding for fabric segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SegmentLengthRounding { get; set; }
Public Property SegmentLengthRounding As Double
	Get
	Set
public:
property double SegmentLengthRounding {
	double get ();
	void set (double value);
}
member SegmentLengthRounding : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for value is not a number
ArgumentOutOfRangeException |  When setting this property: The rounding value is not a positive value.
InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
Remarks
 IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
See Also
Reference
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace